diff_and_count_data_collection/diff_count.getCurrentFoundCount.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:x="http://my.first.mtom.net"
 xmlns:xop="http://www.w3.org/2004/08/xop/include"
 xmlns:xmlmime="http://www.w3.org/2004/11/xmlmime"
 xmlns:ns="urn:diff_count">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
  <ns:getCurrentFoundCount>
  </ns:getCurrentFoundCount>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
